---
kind: property
id: P:Autodesk.Revit.UI.FamilyInstancePlacingArgs.IsBanned
source: html/42059443-b6f0-1dcc-e649-2679381ce6cd.htm
---
# Autodesk.Revit.UI.FamilyInstancePlacingArgs.IsBanned Property

Indicates if the cursor is banned or not.

## Syntax (C#)
```csharp
public bool IsBanned { get; set; }
```